Repository: 84000/data-translation-memory
Catalog: Toh_247-Distinguishing_Phenomena_and_What_Is_Meaningful-v1.tmx
Source language: bo
Languages: en

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: Colophon. Translated, edited, and finalized by the Indian scholars Jinamitra and Dānaśila, as well as by the chief editor and translator, the venerable Yeshé Dé.

source: དེ་ཉིད་དེའི་བུད་མེད་ཀྱི་ལུས་ཀྱི་ཐ་མ་ཡིན་ནོ། །།
en: That will be her last birth as a female.

source: འཕགས་པ་ཆོས་དང་དོན་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །
en: This concludes the noble Great Vehicle sūtra “Distinguishing Phenomena and What Is Meaningful.”

source: རིགས་ཀྱི་བུ་གང་དག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལ་བསྙེན་བཀུར་བྱས་པ་དེ་དག་གིས་མདོ་སྡེ་འདི་རྙེད་པར་འགྱུར་རོ། །
en: “Noble son, only those who have served as many buddhas as there are grains of sand in the Ganges River will come across this discourse.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྒྱལ་བས་དགའ་ལ་བཀའ་སྩལ་པ།
en: At that time, the Blessed One recounted the following to the bodhisattva great being Delighted by Victory:
